nxp-mcuxpresso/mcux-sdk/devices/LPC55S36/mcuxpresso/startup_lpc55s36.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    SecureFault_Handler,               // Secure Fault Handler
    0,                                 // ECRP
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    0,                                 // Reserved
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level - LPC55S36
    WDT_BOD_IRQHandler,                // 16 : Windowed watchdog timer, Brownout detect, Flash interrupt
    DMA0_IRQHandler,                   // 17 : DMA0 controller
    GINT0_IRQHandler,                  // 18 : GPIO group 0
    GINT1_IRQHandler,                  // 19 : GPIO group 1
    PIN_INT0_IRQHandler,               // 20 : Pin interrupt 0 or pattern match engine slice 0
    PIN_INT1_IRQHandler,               // 21 : Pin interrupt 1or pattern match engine slice 1
    PIN_INT2_IRQHandler,               // 22 : Pin interrupt 2 or pattern match engine slice 2
    PIN_INT3_IRQHandler,               // 23 : Pin interrupt 3 or pattern match engine slice 3
    UTICK0_IRQHandler,                 // 24 : Micro-tick Timer
    MRT0_IRQHandler,                   // 25 : Multi-rate timer
    CTIMER0_IRQHandler,                // 26 : Standard counter/timer CTIMER0
    CTIMER1_IRQHandler,                // 27 : Standard counter/timer CTIMER1
    SCT0_IRQHandler,                   // 28 : SCTimer/PWM
    CTIMER3_IRQHandler,                // 29 : Standard counter/timer CTIMER3
    FLEXCOMM0_IRQHandler,              // 30 : Flexcomm Interface 0 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM1_IRQHandler,              // 31 : Flexcomm Interface 1 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM2_IRQHandler,              // 32 : Flexcomm Interface 2 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM3_IRQHandler,              // 33 : Flexcomm Interface 3 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM4_IRQHandler,              // 34 : Flexcomm Interface 4 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM5_IRQHandler,              // 35 : Flexcomm Interface 5 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM6_IRQHandler,              // 36 : Flexcomm Interface 6 (USART, SPI, I2C, I2S, FLEXCOMM)
    FLEXCOMM7_IRQHandler,              // 37 : Flexcomm Interface 7 (USART, SPI, I2C, I2S, FLEXCOMM)
    ADC0_IRQHandler,                   // 38 : ADC0
    ADC1_IRQHandler,                   // 39 : ADC1
    ACMP_IRQHandler,                   // 40 : ACMP interrupts
    DMIC_IRQHandler,                   // 41 : Digital microphone and DMIC subsystem
    HWVAD0_IRQHandler,                 // 42 : Hardware Voice Activity Detector
    USB0_NEEDCLK_IRQHandler,           // 43 : USB Activity Wake-up Interrupt
    USB0_IRQHandler,                   // 44 : USB device
    RTC_IRQHandler,                    // 45 : RTC alarm and wake-up interrupts
    EZH_ARCH_B0_IRQHandler,            // 46 : EZH interrupt
    WAKEUP_IRQHandler,                 // 47 : Wakeup interrupt
    PIN_INT4_IRQHandler,               // 48 : Pin interrupt 4 or pattern match engine slice 4 int
    PIN_INT5_IRQHandler,               // 49 : Pin interrupt 5 or pattern match engine slice 5 int
    PIN_INT6_IRQHandler,               // 50 : Pin interrupt 6 or pattern match engine slice 6 int
    PIN_INT7_IRQHandler,               // 51 : Pin interrupt 7 or pattern match engine slice 7 int
    CTIMER2_IRQHandler,                // 52 : Standard counter/timer CTIMER2
    CTIMER4_IRQHandler,                // 53 : Standard counter/timer CTIMER4
    OS_EVENT_IRQHandler,               // 54 : OS_EVENT_TIMER and OS_EVENT_WAKEUP interrupts
    FlexSPI0_IRQHandler,               // 55 : FlexSPI interrupt
    Reserved56_IRQHandler,             // 56 : Reserved interrupt
    Reserved57_IRQHandler,             // 57 : Reserved interrupt
    Reserved58_IRQHandler,             // 58 : Reserved interrupt
    CAN0_IRQ0_IRQHandler,              // 59 : CAN0 interrupt0
    CAN0_IRQ1_IRQHandler,              // 60 : CAN0 interrupt1
    SPI_FILTER_IRQHandler,             // 61 : SPI Filter interrupt
    Reserved62_IRQHandler,             // 62 : Reserved interrupt
    Reserved63_IRQHandler,             // 63 : Reserved interrupt
    Reserved64_IRQHandler,             // 64 : Reserved interrupt
    SEC_HYPERVISOR_CALL_IRQHandler,    // 65 : SEC_HYPERVISOR_CALL interrupt
    SEC_GPIO_INT0_IRQ0_IRQHandler,     // 66 : SEC_GPIO_INT00 interrupt
    SEC_GPIO_INT0_IRQ1_IRQHandler,     // 67 : SEC_GPIO_INT01 interrupt
    Freqme_IRQHandler,                 // 68 : frequency measure interrupt
    SEC_VIO_IRQHandler,                // 69 : SEC_VIO interrupt
    ELS_IRQHandler,                    // 70 : ELS and ELS error interrupts
    PKC_IRQHandler,                    // 71 : Public Key Cryptography interrupt
    PUF_IRQHandler,                    // 72 : PUF interrupt
    POWERQUAD_IRQHandler,              // 73 : PowerQuad interrupt
    DMA1_IRQHandler,                   // 74 : DMA1 interrupt
    FLEXCOMM8_IRQHandler,              // 75 : LSPI_HS interrupt
    CDOG_IRQHandler,                   // 76 : CodeWDG interrupt
    Reserved77_IRQHandler,             // 77 : Reserved interrupt
    I3C0_IRQHandler,                   // 78 : I3C interrupt
    Reserved79_IRQHandler,             // 79 : Reserved interrupt
    Reserved80_IRQHandler,             // 80 : Reserved interrupt
    ELS_IRQ1_IRQHandler,               // 81 : ELS_IRQ1
    Tamper_IRQHandler,                 // 82 : Tamper
    Reserved83_IRQHandler,             // 83 : Reserved interrupt
    Reserved84_IRQHandler,             // 84 : Reserved interrupt
    Reserved85_IRQHandler,             // 85 : Reserved interrupt
    Reserved86_IRQHandler,             // 86 : Reserved interrupt
    Reserved87_IRQHandler,             // 87 : Reserved interrupt
    Reserved88_IRQHandler,             // 88 : Reserved interrupt
    Reserved89_IRQHandler,             // 89 : Reserved interrupt
    DAC0_IRQHandler,                   // 90 : dac0 interrupt
    DAC1_IRQHandler,                   // 91 : dac1 interrupt
    DAC2_IRQHandler,                   // 92 : dac2 interrupt
    HSCMP0_IRQHandler,                 // 93 : hscmp0 interrupt
    HSCMP1_IRQHandler,                 // 94 : hscmp1 interrupt
    HSCMP2_IRQHandler,                 // 95 : hscmp2 interrupt
    FLEXPWM0_CAPTURE_IRQHandler,       // 96 : flexpwm0_capture interrupt
    FLEXPWM0_FAULT_IRQHandler,         // 97 : flexpwm0_fault interrupt
    FLEXPWM0_RELOAD_ERROR_IRQHandler,  // 98 : flexpwm0_reload_error interrupt
    FLEXPWM0_COMPARE0_IRQHandler,      // 99 : flexpwm0_compare0 interrupt
    FLEXPWM0_RELOAD0_IRQHandler,       // 100: flexpwm0_reload0 interrupt
    FLEXPWM0_COMPARE1_IRQHandler,      // 101: flexpwm0_compare1 interrupt
    FLEXPWM0_RELOAD1_IRQHandler,       // 102: flexpwm0_reload1 interrupt
    FLEXPWM0_COMPARE2_IRQHandler,      // 103: flexpwm0_compare2 interrupt
    FLEXPWM0_RELOAD2_IRQHandler,       // 104: flexpwm0_reload2 interrupt
    FLEXPWM0_COMPARE3_IRQHandler,      // 105: flexpwm0_compare3 interrupt
    FLEXPWM0_RELOAD3_IRQHandler,       // 106: flexpwm0_reload3 interrupt
    FLEXPWM1_CAPTURE_IRQHandler,       // 107: flexpwm1_capture interrupt
    FLEXPWM1_FAULT_IRQHandler,         // 108: flexpwm1_fault interrupt
    FLEXPWM1_RELOAD_ERROR_IRQHandler,  // 109: flexpwm1_reload_error interrupt
    FLEXPWM1_COMPARE0_IRQHandler,      // 110: flexpwm1_compare0 interrupt
    FLEXPWM1_RELOAD0_IRQHandler,       // 111: flexpwm1_reload0 interrupt
    FLEXPWM1_COMPARE1_IRQHandler,      // 112: flexpwm1_compare1 interrupt
    FLEXPWM1_RELOAD1_IRQHandler,       // 113: flexpwm1_reload1 interrupt
    FLEXPWM1_COMPARE2_IRQHandler,      // 114: flexpwm1_compare2 interrupt
    FLEXPWM1_RELOAD2_IRQHandler,       // 115: flexpwm1_reload2 interrupt
    FLEXPWM1_COMPARE3_IRQHandler,      // 116: flexpwm1_compare3 interrupt
    FLEXPWM1_RELOAD3_IRQHandler,       // 117: flexpwm1_reload3 interrupt
    ENC0_COMPARE_IRQHandler,           // 118: enc0_compare interrupt
    ENC0_HOME_IRQHandler,              // 119: enc0_home interrupt
    ENC0_WDG_IRQHandler,               // 120: enc0_wdg interrupt
    ENC0_IDX_IRQHandler,               // 121: enc0_idx interrupt
    ENC1_COMPARE_IRQHandler,           // 122: enc1_compare interrupt
    ENC1_HOME_IRQHandler,              // 123: enc1_home interrupt
    ENC1_WDG_IRQHandler,               // 124: enc1_wdg interrupt
    ENC1_IDX_IRQHandler,               // 125: enc1_idx interrupt
    ITRC0_IRQHandler,                  // 126: itrc0 interrupt
    Reserved127_IRQHandler,            // 127: Reserved interrupt
    ELS_ERR_IRQHandler,                // 128: ELS error interrupt
    PKC_ERR_IRQHandler,                // 129: PKC error interrupt
    Reserved130_IRQHandler,            // 130: Reserved interrupt
    Reserved131_IRQHandler,            // 131: Reserved interrupt
    Reserved132_IRQHandler,            // 132: Reserved interrupt
    Reserved133_IRQHandler,            // 133: Reserved interrupt
    FLASH_IRQHandler,                  // 134: flash interrupt
    RAM_PARITY_ECC_ERR_IRQHandler,     // 135: ram_parity_ecc_err interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    // Disable interrupts
    __asm volatile ("cpsid i");
    // Config VTOR & MSPLIM register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    "MSR MSPLIM, %1       \n"
                    :
                    : "r"(g_pfnVectors), "r"(_vStackBase)
                    : "r0", "r1");


#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

